import telebot
import sqlite3
import threading
import time
import schedule
from datetime import datetime, timedelta
from config import TOKEN, DATABASE

bot = telebot.TeleBot(TOKEN)


@bot.message_handler(commands=['start'])
def start(message): 
    bot.send_message(message.chat.id, """
✨ Привет! Я — бот-трекер привычек 🧠
Я помогу тебе организовать день, запомнить важное и выстроить полезные привычки.

С моей помощью ты можешь:
• планировать дела
• вести заметки
• ставить напоминания
• отслеживать прогресс
                     
Моя задача — сделать твою жизнь проще, а повседневные дела — понятнее и структурированнее.
                     
📌 Мои команды:

📅 /Day_plan — добавить план на день
📋 /List_Day_plan — показать планы
Если планов несколько — укажи дату.

📝 /Notes — создать заметку
📚 /List_Notes — показать заметки
Если заметок несколько — также укажи дату.

⏰ /reminders — установить напоминание
ℹ️ /info — список всех команд
""")


@bot.message_handler(commands=['info'])
def start(message):
    bot.send_message(message.chat.id, """                
📌 Мои команды:

📅 /Day_plan — добавить план на день
📋 /List_Day_plan — показать планы
Если планов несколько — укажи дату.

📝 /Notes — создать заметку
📚 /List_Notes — показать заметки
Если заметок несколько — также укажи дату.

⏰ /reminders — установить напоминание
ℹ️ /info — список всех команд
""")


if __name__ == "__main__":
    bot.polling(none_stop=True)